{"meta":{"title":"天射手座的博客","subtitle":"万丈高楼平地起，勿在浮沙筑高台","description":"东南大学17级，华为准入职员工，","author":"天射手座","url":"http://yoursite.com"},"posts":[{"title":"网易暴力辞退患癌员工，程序员如何学会为自己发声，合理争取赔偿","slug":"网易暴力辞退患癌员工，程序员如何学会为自己发声，合理争取赔偿","date":"2019-11-26T07:21:06.000Z","updated":"2019-11-26T09:26:04.978Z","comments":true,"path":"2019/11/26/网易暴力辞退患癌员工，程序员如何学会为自己发声，合理争取赔偿/","link":"","permalink":"http://yoursite.com/2019/11/26/%E7%BD%91%E6%98%93%E6%9A%B4%E5%8A%9B%E8%BE%9E%E9%80%80%E6%82%A3%E7%99%8C%E5%91%98%E5%B7%A5%EF%BC%8C%E7%A8%8B%E5%BA%8F%E5%91%98%E5%A6%82%E4%BD%95%E5%AD%A6%E4%BC%9A%E4%B8%BA%E8%87%AA%E5%B7%B1%E5%8F%91%E5%A3%B0%EF%BC%8C%E5%90%88%E7%90%86%E4%BA%89%E5%8F%96%E8%B5%94%E5%81%BF/","excerpt":"前言\n \"我是网易的一名游戏策划。14年从上海交大毕业后就进入网易工作，5年里，\n我和大部分网易员工一样以“网易人”的称号为傲。\n\n直到18年底开始传出网易毁约应届生、年前最后一天裁员、威胁员工的消息时，仍\n不愿相信这是网易的所为，更想不到不久后我就会在身患绝症的情况下亲身经历逼迫、\n算计、监视、陷害、威胁，甚至被保安赶出公司。\"\n----------------------------------------------------------\n\n以上是一篇名为《网易裁员，让保安把身患绝症的我赶出公司。我在网易亲身经历的噩梦！》\n的开头，当事人是上海交大毕业后入职网易5年的员工，本是怀着憧憬进入了国内top2的游戏\n公司当一名游戏策划，没想到在他确诊癌症两周后，主管给他的绩效打了D，联合Hr逼迫他离\n职，并拒绝一次性赔付N+1赔偿。","text":"前言 \"我是网易的一名游戏策划。14年从上海交大毕业后就进入网易工作，5年里， 我和大部分网易员工一样以“网易人”的称号为傲。 直到18年底开始传出网易毁约应届生、年前最后一天裁员、威胁员工的消息时，仍 不愿相信这是网易的所为，更想不到不久后我就会在身患绝症的情况下亲身经历逼迫、 算计、监视、陷害、威胁，甚至被保安赶出公司。\" ---------------------------------------------------------- 以上是一篇名为《网易裁员，让保安把身患绝症的我赶出公司。我在网易亲身经历的噩梦！》 的开头，当事人是上海交大毕业后入职网易5年的员工，本是怀着憧憬进入了国内top2的游戏 公司当一名游戏策划，没想到在他确诊癌症两周后，主管给他的绩效打了D，联合Hr逼迫他离 职，并拒绝一次性赔付N+1赔偿。 好在当事人沉着冷静，一边在网上搜集争取赔偿的经验帖，一边稳住心态，在网上公开写作争 取社会的支持，最终引起广大人民的注意甚至人民日报的跟进，终网易不得不出面发表道歉声 明，在N+1赔偿的基础上追加12个月工资的“人文关怀”。 网易公司在巨大的舆论压力下才极不情愿地给出N+1赔偿，是公司效益不好吗，并不是。根据网易 2019年Q3财报，网易第三季度实现营收146.4亿元，较去年同期的131.6亿元同比增长11.2%， 考虑考拉业务的出售，持续经营净利润为47.3亿元，同比大增74%。其中当事人所在的网易游戏， 为公司贡献了80%的利润，妥妥的核心部门。所以并不是公司经济不景气，只是网易吃相太难看，榨 干员工价值之后，离职赔偿还不想给。 事件过后，在我看来，这位哥们的成功之处在于： 1、公开写作他明白当前国内法律框架下，舆论压力是和公司谈判的最好的筹码之一，作为游戏策划，他有优秀的写作能力，文章又是那么“标题党”（“癌症”、“保安”、“逼迫”都很容易吸引大众注意）。现在的程序员，很多都业余写一些技术分享文章，有自己的自媒体账号，学会撰文，不仅可以业余做自媒体创收，还可以在遇到公司离职纠纷时，将公司的恶行送上头条，保证自己可以拿到N+1的赔偿。我推荐我自己之前看过的一本书，《学会写作》/粥左罗著这本书起初主要是针对自媒体人群写公众号、简书文章，出品的一本指导书籍，应该是目前自媒体写作领域最好的一本书，有空的时间不妨学习下，以后万一摊上这哥一样的事，还能多一个和公司谈判的筹码。 2、录音、截图保留证据不知道大家有没有仔细看过当事人原文，当事人贴出了一些自己的绩效截图，和hr、主管谈判的录音，这些都是关键性证据，没有绩效截图，网易完全可以翻脸不认，咬定你的工作量和绩效就是倒数。当事人提供的18年11月业绩排名当事人提供的18年12月业绩排名 没有录音，网易也不会勉强承认hr谈话态度不当，一旦走到舆论大众和法律面前，证据最重要，空口无凭，实锤的证据自己容易争取到大众的支持。","raw":null,"content":null,"categories":[],"tags":[{"name":"网易","slug":"网易","permalink":"http://yoursite.com/tags/%E7%BD%91%E6%98%93/"},{"name":"裁员","slug":"裁员","permalink":"http://yoursite.com/tags/%E8%A3%81%E5%91%98/"},{"name":"癌症","slug":"癌症","permalink":"http://yoursite.com/tags/%E7%99%8C%E7%97%87/"}]},{"title":"7年双11活动下来的我的一些感受","slug":"记录自己6年是如何度过双十一的","date":"2019-11-11T10:11:11.000Z","updated":"2019-11-11T10:53:40.318Z","comments":true,"path":"2019/11/11/记录自己6年是如何度过双十一的/","link":"","permalink":"http://yoursite.com/2019/11/11/%E8%AE%B0%E5%BD%95%E8%87%AA%E5%B7%B16%E5%B9%B4%E6%98%AF%E5%A6%82%E4%BD%95%E5%BA%A6%E8%BF%87%E5%8F%8C%E5%8D%81%E4%B8%80%E7%9A%84/","excerpt":"前言今天是2019年11月11日，自我上大学以来这已经是第7个双十一，放在前几年，也许和很多人一样，昨晚我也应该在等零点后买买买，不过这两年的双十一我都没有参与，包括盛行于朋友圈的盖楼活动。我之所以会这样，主要源自于这几年参与双十一给我带来的感受，下面就和大家分享下：","text":"前言今天是2019年11月11日，自我上大学以来这已经是第7个双十一，放在前几年，也许和很多人一样，昨晚我也应该在等零点后买买买，不过这两年的双十一我都没有参与，包括盛行于朋友圈的盖楼活动。我之所以会这样，主要源自于这几年参与双十一给我带来的感受，下面就和大家分享下： 我的几点感受1、从无到有的购买欲。其实没有双十一，我11月附近可能并没有什么想买的东西，但是双十一铺天盖地的宣传都在告诉我“双十一优惠大，买到就是赚到”。这促使我去思考自己有没有需要买的东西，即从自己急需的，到未来可能需要的，到需要囤积的，总之双十一让我买了很多我其实不一定需要买的东西。 2、复杂的规则。早在2014年双十一，双十一的规则其实非常简单，做游戏拿红包，红包可以理解为钱，双十一购物时候直接抵扣，没有门槛，没有最低消费，那个时候我大概攒了50多块的红包，主要是玩一些挖矿之类的小游戏，难度很低，是个人都能过关。那个时候不需要组队，不需要拉好友助力，不需要消费者互相盖楼竞争比输赢，不看规则直接上手就能参与，真的是非常的良心。而现在复杂的规则，需要去打扰朋友圈的好友帮忙助力，最后拿到的红包可能还不如我14年参与时50多块的红包多，算上耗在活动上的时间和精力，请从小学到大学的好友盖楼欠下的人情，双十一的性价比已经大不如以前。 3、真正的优惠减少。15年到17年，每年双十一我都会去耐克旗舰店买鞋，500多的鞋双十一那天基本可以半价拿下，不过近几年双十一，感觉鞋这块优惠变少了，更多需要整点抢购一些店铺的满减券，这个对我来说很致命，因为读研后事情比较多，不像本科可以一个下午泡在双十一的网站上，我最多可以提前收藏好想买的鞋，等0点下单。也就是如果消费者想要优惠，就需要大概从10月半起开始关注，到11月11号攒好各类优惠券。从经济学上说，就是商家为了利润最大化而采用的“价格歧视”（肯花时间和精力的给予较大优惠，直接双十一下单的给予较少优惠）。 我的双十一购物记录通过检索历史订单关键词“双11”，我查询到了我所有的双十一购买记录2019.11.11无2018.11.11无2017.11.11一件阿迪达斯外套、一双耐克鞋、麦斯威尔咖啡100条实惠装2016.11.11考研政治冲刺卷套装2015.11.11两双阿迪达斯运动鞋2014.11.11一个蓝牙耳机2013.11.11未参与","raw":null,"content":null,"categories":[],"tags":[{"name":"双十一","slug":"双十一","permalink":"http://yoursite.com/tags/%E5%8F%8C%E5%8D%81%E4%B8%80/"},{"name":"我的大学","slug":"我的大学","permalink":"http://yoursite.com/tags/%E6%88%91%E7%9A%84%E5%A4%A7%E5%AD%A6/"}]},{"title":"耗时半年，机械转行IT，我拿到了华为应届生顶薪offer","slug":"耗时半年，机械转行IT，我拿到了华为应届生顶薪offer","date":"2019-11-01T18:04:27.000Z","updated":"2019-11-11T10:12:12.334Z","comments":true,"path":"2019/11/02/耗时半年，机械转行IT，我拿到了华为应届生顶薪offer/","link":"","permalink":"http://yoursite.com/2019/11/02/%E8%80%97%E6%97%B6%E5%8D%8A%E5%B9%B4%EF%BC%8C%E6%9C%BA%E6%A2%B0%E8%BD%AC%E8%A1%8CIT%EF%BC%8C%E6%88%91%E6%8B%BF%E5%88%B0%E4%BA%86%E5%8D%8E%E4%B8%BA%E5%BA%94%E5%B1%8A%E7%94%9F%E9%A1%B6%E8%96%AAoffer/","excerpt":"\n\n前言时间回到2018年年底，我还是一个连C语言 Visual Studio、Java Eclipse这些最常见的IDE没打开过的小白，\n由于现有本科专业是机械，属于知乎典型劝退专业，并且研究生依然在本专业读研，起初并没有什么转行的念头。\n然而临近毕业，发现自己的行业薪资低、前景惨淡，镇定思痛后决定转行迈入IT领域，凭借着正确的打法和战略，通过大半年的学习时间，我成功拿到了华为的顶薪offer(30w+)。这篇文章的目的主要是帮助和我一样的0基础小白，采用什么样的打法来迅速入门，在秋招季拿到自己心仪的offer。","text":"前言时间回到2018年年底，我还是一个连C语言 Visual Studio、Java Eclipse这些最常见的IDE没打开过的小白， 由于现有本科专业是机械，属于知乎典型劝退专业，并且研究生依然在本专业读研，起初并没有什么转行的念头。 然而临近毕业，发现自己的行业薪资低、前景惨淡，镇定思痛后决定转行迈入IT领域，凭借着正确的打法和战略，通过大半年的学习时间，我成功拿到了华为的顶薪offer(30w+)。这篇文章的目的主要是帮助和我一样的0基础小白，采用什么样的打法来迅速入门，在秋招季拿到自己心仪的offer。 前期准备在2018年12月份左右我开启了转行的前期调研工作,由于自己是非科班出身，缺少计算机基础，我首先考虑的是入手若干计算机教材进行学习，此处我参考的是中山大学硕士生CyC2018的书单，但由于该书单更多针对科班学生，且数量过多（在部分内容上推荐了2本书以上，其实我们只需取一本来看，此外包含一些竞赛类书目我们也可以略去不看），推荐顺序上没有按照重要性来排序，因此我根据自己的实际学习经历，重新调整了书单，共计12本，严格按照转行的同学最适合学习的顺序排序： 1、《算法（第 4 版）》 2、《数据结构》 3、《现代操作系统》 4、《计算机网络：自顶向下方法》 5、《TCP/IP 详解 卷 1：协议》 6、《鸟哥的 Linux 私房菜》 7、《MySQL 必知必会》 8、《Head First 设计模式》 9、《Redis 设计与实现》 10、《大型网站技术架构》 11、《剑指 Offer 题解》 12、《程序员代码面试指南：IT 名企算法与数据结构题目最优解》这里需要额外说明下：《鸟哥的 Linux 私房菜》和《Head First 设计模式》，这两本属于内容比较多，书比较厚的书，但是在秋招笔面试过程中相对要求不那么高的内容，也就是如果花费过多时间占用宝贵的复习时间的话，性价比不是那么高，建议在复习这两本书时控制下进度，不要过慢，甚至可以先行搁置，回头再以突击的形式进行学习。 这些大部分都是一些经典教材，可以在网上买到，也可以从学校的图书馆借到，如果觉得比较贵的书籍,可以从淘宝买二手资源或者电子版，我个人的话还是推荐纸质版，阅读起来相对比较有感觉。 ——————————————————————分割线——————————————————————准备好了教材，就要做好时间规划，我自己当时的时间规划是这样的：看书的进度控制在一个月3本左右，也就是大概10天看完一本，其中最为重要的是《数据结构》、《算法》这两本书，可以说无论你去面试哪家公司都会考察算法与数据结构，可以说学到就是赚到，希望还在学习的同学们在这本书肯下大功夫。总体上要控制在实习生招聘（集中在3-4月）之前,基本搭建好自己的知识体系，并且有一个相对能看的简历。 很多非应届毕业生或者刚转行的同学可能并不了解实习的重要性，尤其是IT领域实习的重要性，如果想去大厂的同学，请务必在3-4月拿到一份实习offer，这是去大厂最好的敲门砖，因为实习可以通过转正答辩直接拿到大厂的offer。就好比高考是一条人生捷径一样，不是说不实习秋招就不能去大厂，而是目前被无数次证明过实习转正是去大厂的最好的捷径没有之一，对于非科班的学生更是如此。即使你没有时间去实习，你还是要去参加实习生面试，因为这样可以帮助你提前了解企业的面试流程，在面试中你可以得到反馈，知道自己的薄弱点在哪里，4-7月就有更加针对性地复习，这样秋招的时候你就已经快人一步，把竞争对手甩在了后面。此外，部分企业如阿里，如果你通过了实习生的面试，拿了阿里的实习生offer，即使你没有去实习，秋招是可以直通终面的。总之，我强烈推荐大家认真备战准备春季的实习生招聘，打好走向大厂的第一枪。在4-7月属于春季招聘到秋季招聘（主要是在7-9月）之间的一段空窗期，这段时间要开始结合leetcode网站开始刷题，可以从leetcode 热度top100题开始刷起，题目难度主要以easy和medium为主，时间不要超过两个月，边刷题边学习。 项目经历对于部分同学，一些转行的同学来说，项目经历是一大痛点，我们以前学的根本就不是计算机，哪里来的项目经历？这里如果你已经拿到了实习offer，恭喜你实习经历可以很好的填补这一块空白，如果你没有拿到实习offer或者没有时间去实习，我们可以借助Github一些众多的开源项目，在项目的基础上进行改进，加入自己的创新点。我们也可以在Bilibili上搜索“java实用项目”“C++项目”，也有一堆项目的视频教学。项目有很多，挑选一个好的项目来做很重要，简历上一份烂大街的“XX电商项目”可能不会让面试官眼前一亮，一个还在使用SSH框架，这种已经过时的技术的项目可能也不是一个好项目。 如何判断一个项目是否是一个让面试官欣赏的好项目？它应该满足如下条件： 1、有一定的技术难度这个很好理解，如果你的项目里面都是CURD，维护性的功能居多，面试官无法判断这个项目的价值在哪里，也就不是一个简历加分项 2、技术与企业主流需求匹配如果目前主流的技术框架是SpringBoot、SpringCloud，那么企业肯定更偏爱有相关开发经验的人才，而不是一个项目经历中使用的还是10年前技术框架的同学。 3、项目选型新颖这个相对来说有一定难度，如果不是自己的科研项目，很多同学从网上搜索到的项目都容易落入俗套，例如”某某电商项目”、“某某后台管理系统”，对于面试官来说，这样的项目见得太多，容易审美疲劳，甚至觉得你可能是从网上直接照搬到简历来的，印象分大打折扣。找项目是个技术活，有心的同学可以多在网上搜索搜索，也可以是来自生活的灵感，做一些有一定的创新性的项目。","raw":null,"content":null,"categories":[],"tags":[{"name":"转行","slug":"转行","permalink":"http://yoursite.com/tags/%E8%BD%AC%E8%A1%8C/"},{"name":"华为","slug":"华为","permalink":"http://yoursite.com/tags/%E5%8D%8E%E4%B8%BA/"}]}]}